[
    {
        "details_id": "0282e0e58a5c404fbd15261f11c2ab6a",
        "course_id": "01",
        "info": {
            "students": "24,146",
            "duration": "1h 55m",
            "difficulty": "Beginner"
        },
        "title": "Hand-Code Your First Website: HTML + CSS Basics",
        "author": {
            "name": "Rich Armstrong",
            "profession": "Artist & Designer"
        },
        "image_url": "https://images.unsplash.com/photo-1493119508027-2b584f234d6c?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=580&q=80",
        "details": "For me, being able to create my own websites with HTML and CSS has been empowering. Liberating. And a way of creating and expressing myself. It's also given me opportunities to freelance, work for agencies, work at startups, and run my own studio. During the class you'll be creating a website for your favourite cartoon hero. I'll share my insights and best practices for planning and creating a simple one-page website. We'll cover browsers, code editors, planning, how to back up your code, and how to publish your website. You'll see that it's not that hard or scary to create a website! Whether you're an absolute novice or have dabbled in some web design and development before, by the end of this class you'll know how to hand-code basic websites and have a solid foundation to add further web-related learning to. Also, your friends will be jealous and your mom will be super proud. And you'll feel like Neo from The Matrix."
    },
    {
        "details_id": "0282e0e58a5c404fbd15261f11c2ab6b",
        "course_id": "02",
        "info": {
            "students": "12,681",
            "duration": "16h 47m",
            "difficulty": "Beginner"
        },
        "title": "Responsive Web Design Essentials - HTML5 CSS3 Bootstrap",
        "author": {
            "name": "Daniel Scott",
            "profession": "Adobe Certified Trainer"
        },
        "image_url": "https://images.unsplash.com/photo-1587440871875-191322ee64b0?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8OHx8d2ViJTIwZGVzaWdufGVufDB8fDB8fA%3D%3D&auto=format&fit=crop&w=500&q=60",
        "details": "Hi there, my name is Daniel Scott and together we’re going to learn how to build professional responsive web sites. which look good on mobiles, tablets and desktop screens. We cover everything you need to build your first website. From creating your first page through to uploading your website to the internet. We’ll use the world’s most popular (and free) web design tool called Visual Studio Code. There are exercise files you can download and then work along with me. At the end of each video I have a downloadable version of where we are in the process so that you can compare your project with mine. This will enable you to see easily where you might have a problem. We will delve into all the good stuff such as how to create your very own mobile burger menu from scratch learning some basic JavaScript and jQuery. "
    },
    {
        "details_id": "f69a695f037cd9484cecaea37ca71011",
        "course_id": "03",
        "info": {
            "students": "17,117",
            "duration": "5h 36m",
            "difficulty": "Intermediate"
        },
        "title": "Full Stack Web Development for Beginners- Part 1: HTML, CSS, Responsive Design",
        "author": {
            "name": "Chris Dixon",
            "profession": "Web Developer & Online Teacher"
        },
        "image_url": "https://images.unsplash.com/photo-1573496546735-c274b1fd186b?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8Nnx8ZnVsbCUyMHN0YWNrJTIwZGV2ZWxvcGVyfGVufDB8fDB8fA%3D%3D&auto=format&fit=crop&w=500&q=60",
        "details": "Welcome to Full Stack Web Development for Beginners! Hello, My name is Chris and I am a Web Developer from the UK. I am an experienced trainer leading web development bootcamps and also teaching online courses. My main areas of interest are Vue.js, WordPress, Shopify, Javascript, eCommerce, and business. I am passionate about what I do and about teaching others. Whatever your reason for learning to build websites you have made an excellent career choice. My personal motivation was to become my own boss and have more freedom and flexibility in my life. I also enjoy the technical challenge it provides and the way it constantly evolves. I built my first website back in 1999 and I have watched the web evolve into what it is today. "
    },
    {
        "details_id": "f69a695f037cd9484cecaea37ca71012",
        "course_id": "04",
        "info": {
            "students": "20,460",
            "duration": "2h 50m",
            "difficulty": "Beginner"
        },
        "title": "Understanding Web Development: A Beginners Guide to the Web",
        "author": {
            "name": "Christopher Dodd",
            "profession": "Web Developer / Educator"
        },
        "image_url": "https://images.unsplash.com/photo-1565106430482-8f6e74349ca1?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MTh8fHd3d3xlbnwwfHwwfHw%3D&auto=format&fit=crop&w=500&q=60",
        "details": "So you want to become a web developer? Or least, want to know how the web works? I don’t blame you. Web development is an in-demand skill that allows you work from anywhere and earn a great living.Web development is what I learned back in 2015 that has allowed me to travel the world and work remotely for the last two years. In this class, I’ll teach you all the basics that I think you need to know before choosing your long-term learning path in web development. After taking this course, you will understand how the web works and how you can take part in building it. My goal for this class is that, by the end, you will have a broad understanding of web development and become clear of how you want to use this important skill of web development in your professional career or for personal use. "
    },
    {
        "details_id": "11468ed61aee84de492a8b04158a22f9",
        "course_id": "05",
        "info": {
            "students": "866",
            "duration": "3h 37m",
            "difficulty": "Beginner"
        },
        "title": "Build E-Commerce platform in few steps using WIX",
        "author": {
            "name": "Amine Mokhtari",
            "profession": "Developer & video editor"
        },
        "image_url": "https://images.unsplash.com/photo-1472851294608-062f824d29cc?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MTV8fGVjb21tZXJjZSUyMHdlYnNpdGV8ZW58MHx8MHx8&auto=format&fit=crop&w=500&q=60",
        "details": "Hello everyone, You have some skills and you want to share it with your friends or with the whole world. And you want to share it in your own platform so that they can visit it and enjoy what you are sharing or even you can make some paid stuff, but the problem is that you don't have any experience in Programmation so this is the course for you, you can build your own platform and for free without any knowledge and faster than you think. "
    },
    {
        "details_id": "11468ed61aee84de492a8b04158a22f0",
        "course_id": "06",
        "info": {
            "students": "29,411",
            "duration": "8h 26m",
            "difficulty": "Beginner"
        },
        "title": "WordPress Academy: Learn WordPress step by step",
        "author": {
            "name": "Chris Dixon",
            "profession": "Web Developer & Online Teacher"
        },
        "image_url": "https://images.unsplash.com/photo-1616469832301-ffaeadc68cf3?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8Nnx8d3d3fGVufDB8fDB8fA%3D%3D&auto=format&fit=crop&w=500&q=60",
        "details": "Take your HTML & CSS skills to the next level, by mastering the worlds most popular content management system for building websites! Master WordPress from scratch in a fun, project based approach. This course is for anybody looking for a career building WordPress websites or themes, or even hobbyists looking to learn a new skill. We begin the course by getting familiar with WordPress and looking at how to install using a localhost. Beginning with a music festival landing page, where you will get to grips with the new Gutenberg editor. We also look at widgets, adding pages, installing themes and the media library. We then look at the WordPress essentials such as blog posts, pages, navigation menus and installing themes, all while building your very own blog website. Once we have the basics covered, we move onto customising our blog using sliders, widgets, header images and working with the customiser. You will also get the chance to optimise your website for search engines and create backups. The third project takes your WordPress knowledge even further. We create a fully functional eCommerce T-Shirt store. More techniques are introduced throughout this project such as child themes, dealing with products, categories, shipping, taxes, all while building a beautiful, custom website. After completing the first 2 projects, we move things on even further by introducing you to WordPress theme development by converting an existing HTML & CSS website to a fully functional WordPress theme. This section involves coding in PHP, however if you are new to PHP there is a PHP basics section to get you up to speed. This project introduces new techniques and you will gain a deeper knowledge of how WordPress themes are created. You will learn how WordPress templates are used and learn about various WordPress functions to build our theme. Finally, the last section will be focused on useful techniques to add to your WordPress knowledge. Here we will cover exporting your localhost websites to a live server, various plugins etc. All images and files etc you will need is included to download, there is also need no extra software, subscriptions or purchases etc to complete or take this course. So are you ready to take your web design or WordPress skills to the next level? Join me now and I look forward to having you on board!"
    }
]